---
kind: type
id: T:Autodesk.Revit.DB.SpecTypeId.Boolean
source: html/a30131d9-e9ea-2c79-8157-ef10335d628b.htm
---
# Autodesk.Revit.DB.SpecTypeId.Boolean

This class contains constants identifying Boolean specs.

## Syntax (C#)
```csharp
public static class Boolean
```